; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-5-3-15)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	package11 - obj
	package12 - obj
	package13 - obj
	package14 - obj
	package15 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	s12 - location
	p0-2 - location
	p0-3 - location
	p0-4 - location
	p0-6 - location
	p1-3 - location
	p2-3 - location
	p3-4 - location
	p4-10 - location
	p5-2 - location
	p6-2 - location
	p6-7 - location
	p6-9 - location
	p6-12 - location
	p7-5 - location
	p7-10 - location
	p8-7 - location
	p11-0 - location
	p11-1 - location
	p11-4 - location
	p11-8 - location
	p12-8 - location
	)
	(:init
	(at driver1 s7)
	(at driver2 s9)
	(at driver3 s4)
	(at driver4 s6)
	(at driver5 s9)
	(at truck1 s2)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s3)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s3)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at package1 s5)
	(at package2 s10)
	(at package3 s11)
	(at package4 s7)
	(at package5 s2)
	(at package6 s7)
	(at package7 s8)
	(at package8 s12)
	(at package9 s2)
	(at package10 s8)
	(at package11 s3)
	(at package12 s2)
	(at package13 s12)
	(at package14 s11)
	(at package15 s1)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s0 p0-4)
	(path p0-4 s0)
	(path s4 p0-4)
	(path p0-4 s4)
	(path s0 p0-6)
	(path p0-6 s0)
	(path s6 p0-6)
	(path p0-6 s6)
	(path s1 p1-3)
	(path p1-3 s1)
	(path s3 p1-3)
	(path p1-3 s3)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-4)
	(path p3-4 s3)
	(path s4 p3-4)
	(path p3-4 s4)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s5 p5-2)
	(path p5-2 s5)
	(path s2 p5-2)
	(path p5-2 s2)
	(path s6 p6-2)
	(path p6-2 s6)
	(path s2 p6-2)
	(path p6-2 s2)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(path s6 p6-12)
	(path p6-12 s6)
	(path s12 p6-12)
	(path p6-12 s12)
	(path s7 p7-5)
	(path p7-5 s7)
	(path s5 p7-5)
	(path p7-5 s5)
	(path s7 p7-10)
	(path p7-10 s7)
	(path s10 p7-10)
	(path p7-10 s10)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s11 p11-0)
	(path p11-0 s11)
	(path s0 p11-0)
	(path p11-0 s0)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s11 p11-4)
	(path p11-4 s11)
	(path s4 p11-4)
	(path p11-4 s4)
	(path s11 p11-8)
	(path p11-8 s11)
	(path s8 p11-8)
	(path p11-8 s8)
	(path s12 p12-8)
	(path p12-8 s12)
	(path s8 p12-8)
	(path p12-8 s8)
	(link s0 s2)
	(link s2 s0)
	(= (time-to-drive s0 s2) 87)
	(= (time-to-drive s2 s0) 87)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 57)
	(= (time-to-drive s6 s0) 57)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 62)
	(= (time-to-drive s11 s0) 62)
	(link s1 s3)
	(link s3 s1)
	(= (time-to-drive s1 s3) 23)
	(= (time-to-drive s3 s1) 23)
	(link s1 s4)
	(link s4 s1)
	(= (time-to-drive s1 s4) 7)
	(= (time-to-drive s4 s1) 7)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 21)
	(= (time-to-drive s7 s1) 21)
	(link s1 s9)
	(link s9 s1)
	(= (time-to-drive s1 s9) 39)
	(= (time-to-drive s9 s1) 39)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 48)
	(= (time-to-drive s5 s2) 48)
	(link s2 s11)
	(link s11 s2)
	(= (time-to-drive s2 s11) 100)
	(= (time-to-drive s11 s2) 100)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 18)
	(= (time-to-drive s7 s3) 18)
	(link s3 s9)
	(link s9 s3)
	(= (time-to-drive s3 s9) 74)
	(= (time-to-drive s9 s3) 74)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 77)
	(= (time-to-drive s2 s4) 77)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 46)
	(= (time-to-drive s9 s4) 46)
	(link s4 s11)
	(link s11 s4)
	(= (time-to-drive s4 s11) 35)
	(= (time-to-drive s11 s4) 35)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 45)
	(= (time-to-drive s8 s5) 45)
	(link s5 s10)
	(link s10 s5)
	(= (time-to-drive s5 s10) 82)
	(= (time-to-drive s10 s5) 82)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 51)
	(= (time-to-drive s3 s6) 51)
	(link s6 s4)
	(link s4 s6)
	(= (time-to-drive s6 s4) 20)
	(= (time-to-drive s4 s6) 20)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 46)
	(= (time-to-drive s8 s6) 46)
	(link s6 s12)
	(link s12 s6)
	(= (time-to-drive s6 s12) 72)
	(= (time-to-drive s12 s6) 72)
	(link s7 s4)
	(link s4 s7)
	(= (time-to-drive s7 s4) 77)
	(= (time-to-drive s4 s7) 77)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 98)
	(= (time-to-drive s11 s7) 98)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 3)
	(= (time-to-drive s3 s8) 3)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 24)
	(= (time-to-drive s9 s8) 24)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 6)
	(= (time-to-drive s10 s8) 6)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 18)
	(= (time-to-drive s2 s9) 18)
	(link s9 s5)
	(link s5 s9)
	(= (time-to-drive s9 s5) 6)
	(= (time-to-drive s5 s9) 6)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 68)
	(= (time-to-drive s1 s10) 68)
	(link s10 s2)
	(link s2 s10)
	(= (time-to-drive s10 s2) 9)
	(= (time-to-drive s2 s10) 9)
	(link s10 s9)
	(link s9 s10)
	(= (time-to-drive s10 s9) 78)
	(= (time-to-drive s9 s10) 78)
	(link s11 s1)
	(link s1 s11)
	(= (time-to-drive s11 s1) 98)
	(= (time-to-drive s1 s11) 98)
	(link s11 s5)
	(link s5 s11)
	(= (time-to-drive s11 s5) 95)
	(= (time-to-drive s5 s11) 95)
	(link s11 s8)
	(link s8 s11)
	(= (time-to-drive s11 s8) 35)
	(= (time-to-drive s8 s11) 35)
	(link s12 s3)
	(link s3 s12)
	(= (time-to-drive s12 s3) 59)
	(= (time-to-drive s3 s12) 59)
	(link s12 s7)
	(link s7 s12)
	(= (time-to-drive s12 s7) 17)
	(= (time-to-drive s7 s12) 17)
	(link s12 s8)
	(link s8 s12)
	(= (time-to-drive s12 s8) 41)
	(= (time-to-drive s8 s12) 41)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver1 s2)
	(at driver2 s3)
	(at driver3 s7)
	(at truck2 s5)
	(at truck3 s9)
	(at package1 s3)
	(at package2 s12)
	(at package3 s6)
	(at package4 s2)
	(at package5 s6)
	(at package6 s0)
	(at package7 s9)
	(at package8 s12)
	(at package9 s2)
	(at package10 s5)
	(at package11 s10)
	(at package12 s8)
	(at package13 s6)
	(at package14 s1)
	(at package15 s3)
	))

(:metric minimize (+ (* 4 (total-time)) (* 3 (fuel-used))))

)

; plan
1. (walk driver3 s4 p3-4)
   deleted: (at driver3 s4)
   added: (at driver3 p3-4)
   goals met: 2 of 20
2. (walk driver3 p3-4 s3)
   deleted: (at driver3 p3-4)
   added: (at driver3 s3)
   goals met: 2 of 20
3. (board-truck driver3 truck2 s3)
   deleted: (at driver3 s3) (empty truck2)
   added: (driving driver3 truck2)
   goals met: 2 of 20
4. (load-truck package11 truck2 s3)
   deleted: (at package11 s3)
   added: (in package11 truck2)
   changed: (load truck2) from 0 to 1, (fuel-per-minute truck2) from 10 to 11
   goals met: 2 of 20
5. (drive-truck truck2 s3 s7 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s7)
   changed: (fuel-used) from 0 to 198
   goals met: 2 of 20
6. (load-truck package4 truck2 s7)
   deleted: (at package4 s7)
   added: (in package4 truck2)
   changed: (load truck2) from 1 to 2, (fuel-per-minute truck2) from 11 to 13
   goals met: 2 of 20
7. (drive-truck truck2 s7 s1 driver3)
   deleted: (at truck2 s7)
   added: (at truck2 s1)
   changed: (fuel-used) from 198 to 471
   goals met: 2 of 20
8. (load-truck package15 truck2 s1)
   deleted: (at package15 s1)
   added: (in package15 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 2 of 20
9. (drive-truck truck2 s1 s3 driver3)
   deleted: (at truck2 s1)
   added: (at truck2 s3)
   changed: (fuel-used) from 471 to 839
   goals met: 2 of 20
10. (unload-truck package15 truck2 s3)
   deleted: (in package15 truck2)
   added: (at package15 s3)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 3 of 20
11. (drive-truck truck2 s3 s7 driver3)
   deleted: (at truck2 s3)
   added: (at truck2 s7)
   changed: (fuel-used) from 839 to 1073
   goals met: 3 of 20
12. (disembark-truck driver3 truck2 s7)
   deleted: (driving driver3 truck2)
   added: (at driver3 s7) (empty truck2)
   goals met: 4 of 20
13. (load-truck package6 truck2 s7)
   deleted: (at package6 s7)
   added: (in package6 truck2)
   changed: (load truck2) from 2 to 3, (fuel-per-minute truck2) from 13 to 16
   goals met: 4 of 20
14. (board-truck driver1 truck2 s7)
   deleted: (at driver1 s7) (empty truck2)
   added: (driving driver1 truck2)
   goals met: 4 of 20
15. (drive-truck truck2 s7 s3 driver1)
   deleted: (at truck2 s7)
   added: (at truck2 s3)
   changed: (fuel-used) from 1073 to 1361
   goals met: 4 of 20
16. (drive-truck truck2 s3 s9 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s9)
   changed: (fuel-used) from 1361 to 2545
   goals met: 4 of 20
17. (drive-truck truck2 s9 s5 driver1)
   deleted: (at truck2 s9)
   added: (at truck2 s5)
   changed: (fuel-used) from 2545 to 2641
   goals met: 5 of 20
18. (load-truck package1 truck2 s5)
   deleted: (at package1 s5)
   added: (in package1 truck2)
   changed: (load truck2) from 3 to 4, (fuel-per-minute truck2) from 16 to 20
   goals met: 5 of 20
19. (drive-truck truck2 s5 s10 driver1)
   deleted: (at truck2 s5)
   added: (at truck2 s10)
   changed: (fuel-used) from 2641 to 4281
   goals met: 4 of 20
20. (load-truck package2 truck2 s10)
   deleted: (at package2 s10)
   added: (in package2 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 4 of 20
21. (unload-truck package11 truck2 s10)
   deleted: (in package11 truck2)
   added: (at package11 s10)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 5 of 20
22. (drive-truck truck2 s10 s8 driver1)
   deleted: (at truck2 s10)
   added: (at truck2 s8)
   changed: (fuel-used) from 4281 to 4401
   goals met: 5 of 20
23. (load-truck package7 truck2 s8)
   deleted: (at package7 s8)
   added: (in package7 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 5 of 20
24. (load-truck package10 truck2 s8)
   deleted: (at package10 s8)
   added: (in package10 truck2)
   changed: (load truck2) from 5 to 6, (fuel-per-minute truck2) from 25 to 31
   goals met: 5 of 20
25. (drive-truck truck2 s8 s3 driver1)
   deleted: (at truck2 s8)
   added: (at truck2 s3)
   changed: (fuel-used) from 4401 to 4494
   goals met: 5 of 20
26. (unload-truck package1 truck2 s3)
   deleted: (in package1 truck2)
   added: (at package1 s3)
   changed: (load truck2) from 6 to 5, (fuel-per-minute truck2) from 31 to 25
   goals met: 6 of 20
27. (drive-truck truck2 s3 s9 driver1)
   deleted: (at truck2 s3)
   added: (at truck2 s9)
   changed: (fuel-used) from 4494 to 6344
   goals met: 6 of 20
28. (unload-truck package7 truck2 s9)
   deleted: (in package7 truck2)
   added: (at package7 s9)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 7 of 20
29. (disembark-truck driver1 truck2 s9)
   deleted: (driving driver1 truck2)
   added: (at driver1 s9) (empty truck2)
   goals met: 7 of 20
30. (board-truck driver2 truck2 s9)
   deleted: (at driver2 s9) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 7 of 20
31. (drive-truck truck2 s9 s3 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s3)
   changed: (fuel-used) from 6344 to 7824
   goals met: 7 of 20
32. (drive-truck truck2 s3 s6 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s6)
   changed: (fuel-used) from 7824 to 8844
   goals met: 7 of 20
33. (walk driver1 s9 p6-9)
   deleted: (at driver1 s9)
   added: (at driver1 p6-9)
   goals met: 7 of 20
34. (drive-truck truck2 s6 s8 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s8)
   changed: (fuel-used) from 8844 to 9764
   goals met: 7 of 20
35. (walk driver1 p6-9 s6)
   deleted: (at driver1 p6-9)
   added: (at driver1 s6)
   goals met: 7 of 20
36. (drive-truck truck2 s8 s11 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s11)
   changed: (fuel-used) from 9764 to 10464
   goals met: 7 of 20
37. (load-truck package3 truck2 s11)
   deleted: (at package3 s11)
   added: (in package3 truck2)
   changed: (load truck2) from 4 to 5, (fuel-per-minute truck2) from 20 to 25
   goals met: 7 of 20
38. (load-truck package14 truck2 s11)
   deleted: (at package14 s11)
   added: (in package14 truck2)
   changed: (load truck2) from 5 to 6, (fuel-per-minute truck2) from 25 to 31
   goals met: 7 of 20
39. (drive-truck truck2 s11 s8 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s8)
   changed: (fuel-used) from 10464 to 11549
   goals met: 7 of 20
40. (walk driver1 s6 p6-2)
   deleted: (at driver1 s6)
   added: (at driver1 p6-2)
   goals met: 7 of 20
41. (walk driver1 p6-2 s2)
   deleted: (at driver1 p6-2)
   added: (at driver1 s2)
   goals met: 8 of 20
42. (drive-truck truck2 s8 s6 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s6)
   changed: (fuel-used) from 11549 to 12975
   goals met: 8 of 20
43. (unload-truck package3 truck2 s6)
   deleted: (in package3 truck2)
   added: (at package3 s6)
   changed: (load truck2) from 6 to 5, (fuel-per-minute truck2) from 31 to 25
   goals met: 9 of 20
44. (drive-truck truck2 s6 s0 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s0)
   changed: (fuel-used) from 12975 to 14400
   goals met: 9 of 20
45. (unload-truck package6 truck2 s0)
   deleted: (in package6 truck2)
   added: (at package6 s0)
   changed: (load truck2) from 5 to 4, (fuel-per-minute truck2) from 25 to 20
   goals met: 10 of 20
46. (drive-truck truck2 s0 s6 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s6)
   changed: (fuel-used) from 14400 to 15540
   goals met: 10 of 20
47. (walk driver1 s2 p2-3)
   deleted: (at driver1 s2)
   added: (at driver1 p2-3)
   goals met: 9 of 20
48. (drive-truck truck2 s6 s8 driver2)
   deleted: (at truck2 s6)
   added: (at truck2 s8)
   changed: (fuel-used) from 15540 to 16460
   goals met: 9 of 20
49. (drive-truck truck2 s8 s5 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s5)
   changed: (fuel-used) from 16460 to 17360
   goals met: 10 of 20
50. (unload-truck package10 truck2 s5)
   deleted: (in package10 truck2)
   added: (at package10 s5)
   changed: (load truck2) from 4 to 3, (fuel-per-minute truck2) from 20 to 16
   goals met: 11 of 20
51. (drive-truck truck2 s5 s8 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s8)
   changed: (fuel-used) from 17360 to 18080
   goals met: 10 of 20
52. (walk driver1 p2-3 s2)
   deleted: (at driver1 p2-3)
   added: (at driver1 s2)
   goals met: 11 of 20
53. (drive-truck truck2 s8 s3 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s3)
   changed: (fuel-used) from 18080 to 18128
   goals met: 11 of 20
54. (drive-truck truck2 s3 s1 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s1)
   changed: (fuel-used) from 18128 to 18496
   goals met: 11 of 20
55. (unload-truck package14 truck2 s1)
   deleted: (in package14 truck2)
   added: (at package14 s1)
   changed: (load truck2) from 3 to 2, (fuel-per-minute truck2) from 16 to 13
   goals met: 12 of 20
56. (drive-truck truck2 s1 s11 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s11)
   changed: (fuel-used) from 18496 to 19770
   goals met: 12 of 20
57. (drive-truck truck2 s11 s5 driver2)
   deleted: (at truck2 s11)
   added: (at truck2 s5)
   changed: (fuel-used) from 19770 to 21005
   goals met: 13 of 20
58. (walk driver1 s2 p2-3)
   deleted: (at driver1 s2)
   added: (at driver1 p2-3)
   goals met: 12 of 20
59. (walk driver1 p2-3 s3)
   deleted: (at driver1 p2-3)
   added: (at driver1 s3)
   goals met: 12 of 20
60. (board-truck driver1 truck3 s3)
   deleted: (at driver1 s3) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 12 of 20
61. (drive-truck truck3 s3 s6 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s6)
   changed: (fuel-used) from 21005 to 21515
   goals met: 12 of 20
62. (disembark-truck driver1 truck3 s6)
   deleted: (driving driver1 truck3)
   added: (at driver1 s6) (empty truck3)
   goals met: 12 of 20
63. (board-truck driver4 truck3 s6)
   deleted: (at driver4 s6) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 12 of 20
64. (walk driver1 s6 p6-2)
   deleted: (at driver1 s6)
   added: (at driver1 p6-2)
   goals met: 12 of 20
65. (walk driver1 p6-2 s2)
   deleted: (at driver1 p6-2)
   added: (at driver1 s2)
   goals met: 13 of 20
66. (drive-truck truck3 s6 s12 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s12)
   changed: (fuel-used) from 21515 to 22235
   goals met: 13 of 20
67. (load-truck package13 truck3 s12)
   deleted: (at package13 s12)
   added: (in package13 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 13 of 20
68. (drive-truck truck3 s12 s6 driver4)
   deleted: (at truck3 s12)
   added: (at truck3 s6)
   changed: (fuel-used) from 22235 to 23027
   goals met: 13 of 20
69. (unload-truck package13 truck3 s6)
   deleted: (in package13 truck3)
   added: (at package13 s6)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 14 of 20
70. (drive-truck truck2 s5 s9 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s9)
   changed: (fuel-used) from 23027 to 23105
   goals met: 13 of 20
71. (drive-truck truck3 s6 s3 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   changed: (fuel-used) from 23105 to 23615
   goals met: 13 of 20
72. (drive-truck truck3 s3 s9 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s9)
   changed: (fuel-used) from 23615 to 24355
   goals met: 14 of 20
73. (drive-truck truck2 s9 s3 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s3)
   changed: (fuel-used) from 24355 to 25317
   goals met: 14 of 20
74. (drive-truck truck2 s3 s8 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s8)
   changed: (fuel-used) from 25317 to 25356
   goals met: 14 of 20
75. (unload-truck package4 truck2 s8)
   deleted: (in package4 truck2)
   added: (at package4 s8)
   changed: (load truck2) from 2 to 1, (fuel-per-minute truck2) from 13 to 11
   goals met: 14 of 20
76. (drive-truck truck2 s8 s12 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s12)
   changed: (fuel-used) from 25356 to 25807
   goals met: 14 of 20
77. (unload-truck package2 truck2 s12)
   deleted: (in package2 truck2)
   added: (at package2 s12)
   changed: (load truck2) from 1 to 0, (fuel-per-minute truck2) from 11 to 10
   goals met: 15 of 20
78. (drive-truck truck2 s12 s3 driver2)
   deleted: (at truck2 s12)
   added: (at truck2 s3)
   changed: (fuel-used) from 25807 to 26397
   goals met: 15 of 20
79. (disembark-truck driver2 truck2 s3)
   deleted: (driving driver2 truck2)
   added: (at driver2 s3) (empty truck2)
   goals met: 16 of 20
80. (drive-truck truck3 s9 s8 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s8)
   changed: (fuel-used) from 26397 to 26637
   goals met: 15 of 20
81. (load-truck package4 truck3 s8)
   deleted: (at package4 s8)
   added: (in package4 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 15 of 20
82. (drive-truck truck3 s8 s9 driver4)
   deleted: (at truck3 s8)
   added: (at truck3 s9)
   changed: (fuel-used) from 26637 to 26901
   goals met: 16 of 20
83. (board-truck driver2 truck2 s3)
   deleted: (at driver2 s3) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 15 of 20
84. (drive-truck truck2 s3 s8 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s8)
   changed: (fuel-used) from 26901 to 26931
   goals met: 15 of 20
85. (drive-truck truck3 s9 s2 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s2)
   changed: (fuel-used) from 26931 to 27129
   goals met: 14 of 20
86. (unload-truck package4 truck3 s2)
   deleted: (in package4 truck3)
   added: (at package4 s2)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 15 of 20
87. (load-truck package5 truck3 s2)
   deleted: (at package5 s2)
   added: (in package5 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 15 of 20
88. (drive-truck truck3 s2 s9 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (fuel-used) from 27129 to 27327
   goals met: 16 of 20
89. (drive-truck truck2 s8 s5 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s5)
   changed: (fuel-used) from 27327 to 27777
   goals met: 17 of 20
90. (drive-truck truck3 s9 s8 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s8)
   changed: (fuel-used) from 27777 to 28041
   goals met: 16 of 20
91. (drive-truck truck3 s8 s6 driver4)
   deleted: (at truck3 s8)
   added: (at truck3 s6)
   changed: (fuel-used) from 28041 to 28547
   goals met: 16 of 20
92. (unload-truck package5 truck3 s6)
   deleted: (in package5 truck3)
   added: (at package5 s6)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 17 of 20
93. (drive-truck truck3 s6 s3 driver4)
   deleted: (at truck3 s6)
   added: (at truck3 s3)
   changed: (fuel-used) from 28547 to 29057
   goals met: 17 of 20
94. (drive-truck truck2 s5 s8 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s8)
   changed: (fuel-used) from 29057 to 29507
   goals met: 16 of 20
95. (drive-truck truck3 s3 s9 driver4)
   deleted: (at truck3 s3)
   added: (at truck3 s9)
   changed: (fuel-used) from 29507 to 30247
   goals met: 17 of 20
96. (drive-truck truck3 s9 s2 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s2)
   changed: (fuel-used) from 30247 to 30427
   goals met: 16 of 20
97. (load-truck package12 truck3 s2)
   deleted: (at package12 s2)
   added: (in package12 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 16 of 20
98. (drive-truck truck3 s2 s9 driver4)
   deleted: (at truck3 s2)
   added: (at truck3 s9)
   changed: (fuel-used) from 30427 to 30625
   goals met: 17 of 20
99. (drive-truck truck2 s8 s5 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s5)
   changed: (fuel-used) from 30625 to 31075
   goals met: 18 of 20
100. (drive-truck truck3 s9 s8 driver4)
   deleted: (at truck3 s9)
   added: (at truck3 s8)
   changed: (fuel-used) from 31075 to 31339
   goals met: 17 of 20
101. (disembark-truck driver2 truck2 s5)
   deleted: (driving driver2 truck2)
   added: (at driver2 s5) (empty truck2)
   goals met: 17 of 20
102. (unload-truck package12 truck3 s8)
   deleted: (in package12 truck3)
   added: (at package12 s8)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 18 of 20
103. (drive-truck truck3 s8 s9 driver4)
   deleted: (at truck3 s8)
   added: (at truck3 s9)
   changed: (fuel-used) from 31339 to 31579
   goals met: 19 of 20
104. (disembark-truck driver4 truck3 s9)
   deleted: (driving driver4 truck3)
   added: (at driver4 s9) (empty truck3)
   goals met: 19 of 20
105. (walk driver2 s5 p5-2)
   deleted: (at driver2 s5)
   added: (at driver2 p5-2)
   goals met: 19 of 20
106. (walk driver2 p5-2 s2)
   deleted: (at driver2 p5-2)
   added: (at driver2 s2)
   goals met: 19 of 20
107. (walk driver2 s2 p2-3)
   deleted: (at driver2 s2)
   added: (at driver2 p2-3)
   goals met: 19 of 20
108. (walk driver2 p2-3 s3)
   deleted: (at driver2 p2-3)
   added: (at driver2 s3)
   goals met: 20 of 20
